app/Http/Controllers/API/ProductSaleController.php

    public function index($sale)

    {
        $sale = Sale::find($sale);
---
select * from `sales` where `sales`.`id` = '24' limit 1