app/Http/Controllers/API/ProductController.php

    public function search($name)
    {
        return Product::where('product_name','like','%'.$name.'%')->with('category','sales')->get();
---
select * from `categories` where `categories`.`id` in (1)
select * from `products` where `product_name` like '%Protex%'