app/Http/Controllers/API/SaleController.php

    public function store(Request $request)
    {
        $this->validate($request,[
            "date"=>"required",
            "customer_contact"=>"required",
        ]);

        $sale=new Sale();
        $sale->customer_name=$request->customer_name;
        $sale->customer_contact=$request->customer_contact;
        $sale->date=$request->date;
        $sale->description=$request->description;
        $sale->save();
---
insert into `sales` (`customer_name`, `customer_contact`, `date`, `description`, `updated_at`, `created_at`) values ('Clementine Mayer', 'Eligendi mollitia ve', '2002-11-22', 'Quam dolores dolorem', '2022-04-17 09:02:45', '2022-04-17 09:02:45')